{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"inputs": {"inputs:0": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}}, "outputs": {"output_boxes:0": {"name": "output_boxes:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2535"}, {"size": "85"}]}}}}}, "modelTopology": {"node": [{"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2028"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/concat_6/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Conv_9/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "255"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/concat_7/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Conv_9/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "255"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "507"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/ResizeNearestNeighbor/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/concat_3/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Conv_12/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "255"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_12/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "255"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape_4/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2028"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "507"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["inputs", "detector/yolo-v3-tiny/Conv/Conv2D_weights", "detector/yolo-v3-tiny/Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_1/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2/MaxPool", "detector/yolo-v3-tiny/Conv_1/Conv2D_weights", "detector/yolo-v3-tiny/Conv_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_1/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_1/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2_1/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_2/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2_1/MaxPool", "detector/yolo-v3-tiny/Conv_2/Conv2D_weights", "detector/yolo-v3-tiny/Conv_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_2/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_2/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2_2/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv_2/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_3/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2_2/MaxPool", "detector/yolo-v3-tiny/Conv_3/Conv2D_weights", "detector/yolo-v3-tiny/Conv_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_3/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_3/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2_3/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv_3/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_4/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2_3/MaxPool", "detector/yolo-v3-tiny/Conv_4/Conv2D_weights", "detector/yolo-v3-tiny/Conv_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_4/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_4/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2_4/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv_4/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_5/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2_4/MaxPool", "detector/yolo-v3-tiny/Conv_5/Conv2D_weights", "detector/yolo-v3-tiny/Conv_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_5/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_5/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/pool2_5/MaxPool", "op": "MaxPool", "input": ["detector/yolo-v3-tiny/Conv_5/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "detector/yolo-v3-tiny/Conv_6/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/pool2_5/MaxPool", "detector/yolo-v3-tiny/Conv_6/Conv2D_weights", "detector/yolo-v3-tiny/Conv_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_6/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_6/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/Conv_7/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/Conv_6/LeakyRelu", "detector/yolo-v3-tiny/Conv_7/Conv2D_weights", "detector/yolo-v3-tiny/Conv_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_7/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_7/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/Conv_8/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/Conv_7/LeakyRelu", "detector/yolo-v3-tiny/Conv_8/Conv2D_weights", "detector/yolo-v3-tiny/Conv_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_10/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/Conv_7/LeakyRelu", "detector/yolo-v3-tiny/Conv_10/Conv2D_weights", "detector/yolo-v3-tiny/Conv_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Conv_8/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_8/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/Conv_10/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_10/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/Conv_9/BiasAdd", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/Conv_8/LeakyRelu", "detector/yolo-v3-tiny/Conv_9/weights", "detector/yolo-v3-tiny/Conv_9/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["detector/yolo-v3-tiny/Conv_10/LeakyRelu", "detector/yolo-v3-tiny/ResizeNearestNeighbor/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape", "op": "Reshape", "input": ["detector/yolo-v3-tiny/Conv_9/BiasAdd", "detector/yolo-v3-tiny/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/concat_3", "op": "ConcatV2", "input": ["detector/yolo-v3-tiny/ResizeNearestNeighbor", "detector/yolo-v3-tiny/Conv_4/LeakyRelu", "detector/yolo-v3-tiny/concat_3/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "detector/yolo-v3-tiny/split", "op": "SplitV", "input": ["detector/yolo-v3-tiny/Reshape", "detector/yolo-v3-tiny/Const", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Conv_11/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/concat_3", "detector/yolo-v3-tiny/Conv_11/Conv2D_weights", "detector/yolo-v3-tiny/Conv_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/Sigmoid", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Exp", "op": "Exp", "input": ["detector/yolo-v3-tiny/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Sigmoid_1", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Sigmoid_2", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_11/LeakyRelu", "op": "LeakyRelu", "input": ["detector/yolo-v3-tiny/Conv_11/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "detector/yolo-v3-tiny/add", "op": "AddV2", "input": ["detector/yolo-v3-tiny/Reshape_3", "detector/yolo-v3-tiny/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_2", "op": "Mul", "input": ["detector/yolo-v3-tiny/Exp", "detector/yolo-v3-tiny/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Conv_12/BiasAdd", "op": "_FusedConv2D", "input": ["detector/yolo-v3-tiny/Conv_11/LeakyRelu", "detector/yolo-v3-tiny/Conv_12/weights", "detector/yolo-v3-tiny/Conv_12/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "detector/yolo-v3-tiny/mul", "op": "Mul", "input": ["detector/yolo-v3-tiny/add", "detector/yolo-v3-tiny/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Reshape_4", "op": "Reshape", "input": ["detector/yolo-v3-tiny/Conv_12/BiasAdd", "detector/yolo-v3-tiny/Reshape_4/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/concat_2", "op": "ConcatV2", "input": ["detector/yolo-v3-tiny/mul", "detector/yolo-v3-tiny/mul_2", "detector/yolo-v3-tiny/Sigmoid_1", "detector/yolo-v3-tiny/Sigmoid_2", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "4"}}}, {"name": "detector/yolo-v3-tiny/split_1", "op": "SplitV", "input": ["detector/yolo-v3-tiny/Reshape_4", "detector/yolo-v3-tiny/Const", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "detector/yolo-v3-tiny/Sigmoid_3", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Exp_1", "op": "Exp", "input": ["detector/yolo-v3-tiny/split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Sigmoid_4", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/Sigmoid_5", "op": "Sigmoid", "input": ["detector/yolo-v3-tiny/split_1:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/add_1", "op": "AddV2", "input": ["detector/yolo-v3-tiny/Reshape_7", "detector/yolo-v3-tiny/Sigmoid_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_5", "op": "Mul", "input": ["detector/yolo-v3-tiny/Exp_1", "detector/yolo-v3-tiny/mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/mul_3", "op": "Mul", "input": ["detector/yolo-v3-tiny/add_1", "detector/yolo-v3-tiny/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "detector/yolo-v3-tiny/concat_6", "op": "ConcatV2", "input": ["detector/yolo-v3-tiny/mul_3", "detector/yolo-v3-tiny/mul_5", "detector/yolo-v3-tiny/Sigmoid_4", "detector/yolo-v3-tiny/Sigmoid_5", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "4"}}}, {"name": "detector/yolo-v3-tiny/concat_7", "op": "ConcatV2", "input": ["detector/yolo-v3-tiny/concat_2", "detector/yolo-v3-tiny/concat_6", "detector/yolo-v3-tiny/concat_7/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "split", "op": "SplitV", "input": ["detector/yolo-v3-tiny/concat_7", "Const", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tlen": {"type": "DT_INT32"}, "num_split": {"i": "5"}}}, {"name": "truediv", "op": "Mul", "input": ["ConstantFolding/truediv_recip", "split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "Mul", "input": ["ConstantFolding/truediv_recip", "split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["split", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["split", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["split:1", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["split:1", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_boxes", "op": "ConcatV2", "input": ["sub", "sub_1", "add", "add_1", "split:4", "detector/yolo-v3-tiny/concat_6/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "5"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "detector/yolo-v3-tiny/mul_3/y", "shape": [2], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/mul_4", "shape": [2028, 2], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/concat_6/axis", "shape": [], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/Conv_9/weights", "shape": [1, 1, 512, 255], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/concat_7/axis", "shape": [], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/Conv_9/biases", "shape": [255], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/Const", "shape": [4], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/mul/y", "shape": [2], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/mul_1", "shape": [507, 2], "dtype": "float32"}, {"name": "Const", "shape": [5], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/ResizeNearestNeighbor/size", "shape": [2], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/concat_3/axis", "shape": [], "dtype": "int32"}, {"name": "detector/yolo-v3-tiny/Conv_12/weights", "shape": [1, 1, 256, 255], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_12/biases", "shape": [255], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Reshape_4/shape", "shape": [3], "dtype": "int32"}, {"name": "ConstantFolding/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Reshape_7", "shape": [1, 2028, 2], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Reshape_3", "shape": [1, 507, 2], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv/Conv2D_weights", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_1/Conv2D_weights", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_1/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_2/Conv2D_weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_2/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_3/Conv2D_weights", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_4/Conv2D_weights", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_4/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_5/Conv2D_weights", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_5/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_6/Conv2D_weights", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_6/Conv2D_bn_offset", "shape": [1024], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_7/Conv2D_weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_7/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_8/Conv2D_weights", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_8/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_10/Conv2D_weights", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_10/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_11/Conv2D_weights", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "detector/yolo-v3-tiny/Conv_11/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}]}]}